### Цели исследования
Проанализировать базу данных для сформулирования ценностного предложения для нового продукта. В базе хранится информация о книгах, издательствах, авторах, а также пользовательские обзоры книг.

### Описание данных

**Таблица `books`**

Содержит данные о книгах:

- `book_id` — идентификатор книги;
- `author_id` — идентификатор автора;
- `title` — название книги;
- `num_pages` — количество страниц;
- `publication_date` — дата публикации книги;
- `publisher_id` — идентификатор издателя.

**Таблица `authors`**

Содержит данные об авторах:

- `author_id` — идентификатор автора;
- `author` — имя автора.

**Таблица `publishers`**

Содержит данные об издательствах:

- `publisher_id` — идентификатор издательства;
- `publisher` — название издательства;

**Таблица `ratings`**

Содержит данные о пользовательских оценках книг:

- `rating_id` — идентификатор оценки;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, оставившего оценку;
- `rating` — оценка книги.

**Таблица `reviews`**

Содержит данные о пользовательских обзорах на книги:

- `review_id` — идентификатор обзора;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, написавшего обзор;
- `text` — текст обзора.

### Задания

- Посчитайте, сколько книг вышло после 1 января 2000 года;
- Для каждой книги посчитайте количество обзоров и среднюю оценку;
- Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры;
- Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками;
- Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

In [1]:
# импортируем библиотеки
import pandas as pd 
from sqlalchemy import create_engine 

# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
             'pwd': 'Sdf4$2;d-d30pp', # пароль
             'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net', 
             'port': 6432, # порт подключения
             'db': 'data-analyst-final-project-db'} # название базы данных

connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'], 
                                                         db_config['pwd'], 
                                                         db_config['host'], 
                                                         db_config['port'], 
                                                         db_config['db']) 

# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

In [2]:
# функция для вывода первых сторок таблиц
def table_query(table_name):
    for name in table_name:
        query = '''
           SELECT *
           FROM {}
        '''.format(name)
        df = pd.io.sql.read_sql(query, con = engine)
        print(f'Таблица {name}')
        display(df.head())
        display(df.shape)

In [3]:
table_list = ['books', 'authors', 'publishers', 'ratings', 'reviews']
table_query(table_list)

Таблица books

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

(1000, 6)

Таблица authors

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

(636, 2)

Таблица publishers

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

(340, 2)

Таблица ratings

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

(6456, 4)

Таблица reviews

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

(2793, 4)

In [4]:
def sql_querys(query):
    df = pd.io.sql.read_sql(query, con = engine)
    return df

**Задание №1**
Посчитать, сколько книг вышло после 1 января 2000 года

In [5]:
query1 = '''
    SELECT COUNT(book_id) AS count_books
    FROM books
    WHERE CAST(publication_date AS date) >= '2000-01-01'; 
    '''

In [6]:
sql_querys(query1)

   count_books
0          821

После 1 января 2000 года вышло 819 книг

**Задание №2**
Для каждой книги посчитайте количество обзоров и среднюю оценку

In [17]:
query2 = '''
    SELECT b.title,
           b.book_id,
           AVG(rt.rating) AS rating,
           COUNT(DISTINCT rv.review_id) AS review
    FROM books AS b 
         LEFT JOIN ratings AS rt ON rt.book_id = b.book_id
         LEFT JOIN reviews AS rv ON rv.book_id = b.book_id
    GROUP BY b.book_id;
    '''

In [18]:
sql_querys(query2)

,title,book_id,rating,review
0,'Salem's Lot,1,3.666667,2
1,1 000 Places to See Before You Die,2,2.500000,1
2,13 Little Blue Envelopes (Little Blue Envelope...,3,4.666667,3
3,1491: New Revelations of the Americas Before C...,4,4.500000,2
4,1776,5,4.000000,4
...,...,...,...,...
995,Wyrd Sisters (Discworld #6; Witches #2),996,3.666667,3
996,Xenocide (Ender's Saga #3),997,3.400000,3
997,Year of Wonders,998,3.200000,4
998,You Suck (A Love Story #2),999,4.500000,2
999,Zen and the Art of Motorcycle Maintenance: An ...,1000,3.833333,4

Расчет произведен для все 1000 книг.

**Задание №3**
Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры

In [89]:
query3 = '''
    SELECT publisher
    FROM publishers
    WHERE publisher_id IN (SELECT publisher_id
                           FROM books
                           WHERE num_pages > 50
                           GROUP BY publisher_id
                           ORDER BY COUNT(book_id) DESC
                           LIMIT 1); 
    '''

In [90]:
sql_querys(query3)

       publisher
0  Penguin Books

Издательство "Penguin Books" выпустило больше всего книг

**Задание №4**
Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками

In [97]:
query4 = '''
    SELECT a.author
    FROM books AS b
    LEFT JOIN authors AS a ON b.author_id = a.author_id
    WHERE b.book_id IN (SELECT book_id
                        FROM ratings
                        GROUP BY book_id
                        HAVING COUNT(rating_id) >= 50
                        ORDER BY AVG(rating) DESC
                        LIMIT 1);
    '''

In [98]:
sql_querys(query4)

                       author
0  J.K. Rowling/Mary GrandPré

Автор с самой высокой средней оценкой книг - J.K. Rowling/Mary GrandPré.

**Задание №5**
Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок

In [109]:
query5 = '''
    SELECT AVG(review)
    FROM 
        (SELECT username,
                COUNT(rating_id) AS rating
         FROM ratings
         GROUP BY username
         HAVING COUNT(rating_id) > 50) AS rt
    LEFT OUTER JOIN
         (SELECT username,
                 COUNT(review_id) AS review
          FROM reviews
          GROUP BY username) AS rv ON rt.username = rv.username;
    '''

In [110]:
sql_querys(query5)

         avg
0  24.333333

Среднее количество обзоров от пользователей 24.3